{
    "pageContent" : {
        "webApps" : {
            "yearOne" : "You are introduced to basic programming. <br>You learn how to Program in Java, and are introduced to HTML, CSS, and JavaScript. You also learn more about your major of choice, Digital Information Design, and what sort of career paths you will have.",
            "yearTwo" : "In your second year you are introduced to more advanced programming. <br>You explore C++, and further your understanding of JavaScript by learning how to host servers in Node.js. You learn quantitative skills, and apply mathematics and statistics to your programs.",
            "yearThree" : "You deepen your understanding of backend web design. <br> You learn to create and maintain databases using SQL, as well as designing and developing web applications. You are also given a brief overview of Digital Media and Digital Commerce, two other concentrations in your major.",
            "yearFour" : "You study interface design and how to apply those skills to your web applications. You also learn software engineering, as well as discuss the ethics of your chosen career path to ensure what you learn isn't used to further the plans of some evil litch or dark overlord."
        },
        "intMedia" : {
            "yearOne" : "You are introduced to the fundamentals of design. <br>You learn the importance of good craft, as well as color theory and how to create good compositions. You also learn the computer tools that you'll be using for your career, such as Adobe Photoshop and Illustrator.",
            "yearTwo" : "You learn more design skills by studying graphic design and typography. <br>You are introduced to design for the web using HTML, CSS, SASS, and JavaScript. At the end of this year, you go through <span>Specialization Review,</span> where your work thus far is evaluated.",
            "yearThree" : "With Specialization Review behind you, you step into advanced-level courses. <br>You study design history and concepts in order to better solve complicated design problems. You also deepen your web design skills, and select an elective to add to your repetoire: Mass Communication, Music, or Graphic Design",
            "yearFour" : "Your fourth and final year. <br>You study interface design as well as multimedia production in order to make your websites more user-friendly, and discuss the ethics of your chosen career path. You also deepen your understanding of your elective of choice."
        },
        "digCommerce" : {
            "yearOne" : "You are introduced to Digital Information Design. <br>You learn about the other concentrations that make up Digital Information Design, and get an overview of programming in Java, HTML, CSS, and JavaScript.",
            "yearTwo" : "Your second year, you are ready to get down to business. <br>You study financing, analytics, and statistics and how to apply these skills to the web. You also study multimedia storytelling, and gain an understanding of design for the web.",
            "yearThree" : "You deepen your understanding of business by researching information systems. You learn how to reach millions of consumers via the internet through advertising and digital marketing.",
            "yearFour" : "You study advanced marketing and how to apply business skills to the electronic world. You also discuss the ethics of your chosen career, as well as select an elective to allow you to specialize in an area of Digital Commerce."
        },
        "massMedia" : {
            "yearOne" : "You begin by learning public speaking and writing. <br>You are also introduced to the various concentrations of Digital Information Design, and learn basic programming in Java, HTML, CSS, and JavaScript.",
            "yearTwo" : "You are introduced to multimedia production. <br>You learn the digital tools used to produce multimedia, such as Adobe Premiere. You are given a cursory overview of accounting and statistics, and learn how to design for the web.",
            "yearThree" : "Your third year, you continue to study multimedia. <br>You learn how to produce content for television audiences and how those skills apply to the web. You also select an elective that will allow you to specialize in a specific area of Digital Mass Media.",
            "yearFour" : "You continue to deepen your understanding in your chosen elective. You also study design for multimedia content, and discuss the ethics of your chosen career path to ensure the skills you learn are not misused."
        }
    },

    "charSelection" : {
        "webApps" : {
            "concentration" : "Web Application Design",
            "body" : "In this code-heavy concentration, you'll hone your skills as a backend programmer by learning multiple programming languages, the protocols that power the web, how to create and maintain databases, and software management skills.",
            "stats" : [100, 40, 20, 20],
            "image" : "web_apps.gif"
        },
        "intMedia" : {
            "concentration" : "Interactive Media",
            "body" : "With a healthy focus on design, Interactive Media will hone your skills for front-end web programming. You'll learn how to solve increasingly-complex design problems on the web and in emerging digital fields and come to effective, successful solutions.",
            "stats" : [40, 100, 20, 20],
            "image" : "im.gif"
        },
        "digCommerce" : {
            "concentration" : "Digital Commerce",
            "body" : "The emergence of the web has huge potential for marketing and commerce in the modern age. In this concentration you'll learn marketing strategies that are successful on the web, as well as how to use digital media to reach millions of consumers over the internet.",
            "stats" : [20, 20, 100, 40],
            "image" : "commerce.gif"
        },
        "massMedia" : {
            "concentration" : "Digital Mass Media",
            "body" : "In Digital Mass Media, you'll learn how to shape web content to reach a specific audience, how to gather and present information, and how the internet is shaping - and will continue to shape - mass media and marketing communication with new and emerging technologies. ",
            "stats" : [20, 20, 40, 100],
            "image" : "media.gif"
        }
    },

    "capstone" : {
        "explanation" : "Teaming up with another student from each concentration, put everything you've learned over the last four years to the test and take on a real web project for a real-world client.<br><span>This will be the toughest challenge that you face.</span>",
        "image" : "bossglow.gif"
    },

    "ending" : {
        "text1" : "Congratulations! You found the Golden Graduation Cap. However, there are more journeys to be had with Digital Information Design...",
        "text2" : "Want to learn more about DIFD? Enter your email:",
        "image" : "treasure.gif"
    }
}
